[
    {
        "company": "EY",
        "description": "Job Summary: We are seeking a skilled Data Engineer with 3-5 years of experience to join our data team. The ideal candidate will bring expertise in AWS, PySpark, SQL, Python, and have a strong background in campaign and marketing analytics. As a Data Engineer in our organization, you will play a crucial role in developing and enhancing data systems that provide deep insights into customer behaviors and the effectiveness of marketing campaigns, ultimately driving strategic business decisions.\n \n  Must have- Tech stack- AWS, EMR , PYSPARK, SQL, Airflow, CICD, Kafka.\n \n  Key Responsibilities:\n \n   Design, construct, and maintain data architectures and pipelines that support campaign and marketing analytics.\n   Utilize AWS cloud services (Redshift, EMR, RDS, Glue, Athena, S3) to build scalable and reliable data storage and processing solutions.\n   Create and fine-tune PySpark jobs for big data transformations and aggregations necessary for marketing analysis.\n   Write complex SQL queries to analyze campaign performance, customer segmentation, and ROI.\n   Create pipelines for campaigns that needs to be triggered on daily basis in real time for eligible customers. \n  Would add new logics as per the campaign’s requirement and new customer bases to this pipeline. \n  Collaborate with Campaign managers and various bank businesses i.e. (Debit Card, Wealth and Insurance etc.) to understand the requirement every week. \n  Develop data sets and pipelines that enable real-time analysis of marketing campaigns.\n   Collaborate with marketing teams to understand their data needs and provide insights through advanced analytical models.\n   Integrate various data sources to deliver a comprehensive view of customer interactions across channels.\n   Implement tracking and measurement solutions for online and offline campaigns.\n   Contribute to the improvement of data quality and the enrichment of data sources for accuracy in reporting and analysis.\n   Work on predictive modelling of customer behaviour and campaign outcomes using Python.\n   Develop dashboards and visualizations in reporting tools to communicate actionable insights to the marketing team.\n   Drive data governance and compliance initiatives related to marketing data.\n   Stay updated with the latest trends in marketing analytics, campaign management tools, and data processing technologies.\n \n \n  Qualifications and Skills:\n \n   Bachelor's or Master's degree in Computer Science, Data Science, Statistics, or a related field.\n   3-5 years of hands-on experience in a Data Engineering role with a focus on marketing analytics.\n   Proficiency in Python and PySpark for data processing and analysis.\n   Strong knowledge of SQL and experience with cloud-based data warehousing solutions, especially in an AWS environment.\n   Demonstrated experience with end-to-end architecture and pipeline creation for marketing and campaign data.\n   Familiarity with campaign management platforms, web analytics, SEO/SEM, and social media analytics.\n   Experience with data visualization and BI tools (e.g., Tableau, Power BI, Looker).\n   Ability to translate business requirements into technical specifications and data solutions.\n   Excellent communication and teamwork abilities."
    },
    {
        "company": "JPMorgan Chase & Co",
        "description": "JOB DESCRIPTION\n  We have an exciting and rewarding opportunity for you to take your software engineering career to the next level. \n As a Java/Oracle Developer Software Engineer III at JPMorgan Chase within the Corporate & Investment Bank Payments Technology Team, you serve as a seasoned member of an agile team to design and deliver trusted market-leading technology products in a secure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives.\n  Job responsibilities\n  \n  Executes software solutions, design, development, and technical troubleshooting with ability to think beyond routine or conventional approaches to build solutions or break down technical problems \n  Creates secure and high-quality production code and maintains algorithms that run synchronously with appropriate systems \n  Produces architecture and design artifacts for complex applications while being accountable for ensuring design constraints are met by software code development \n  Gathers, analyzes, synthesizes, and develops visualizations and reporting from large, diverse data sets in service of continuous improvement of software applications and systems \n  Proactively identifies hidden problems and patterns in data and uses these insights to drive improvements to coding hygiene and system architecture \n  Contributes to software engineering communities of practice and events that explore new and emerging technologies \n  Adds to team culture of diversity, equity, inclusion, and respect\n \n  \n Required qualifications, capabilities, and skills\n  \n  Formal training or certification on software engineering concepts and 3+ years applied experience \n  Hands-on practical experience in system design, application development, testing, and operational stability \n  Proficient in coding in one or more languages \n  A strong AWS is considered a valuable asset familiarity with AWS services such as EC2,ECS Fargate , RDS , Aurora lambda can enhance the ability to design , deploy and manage scalable and reliable cloud based solution \n  Experience in developing, debugging, and maintaining code in a large corporate environment with one or more modern programming languages and database querying languages \n  Overall knowledge of the Software Development Life Cycle \n  Solid understanding of agile methodologies such as CI/CD, Application Resiliency, and Security \n  Demonstrated knowledge of software applications and technical processes within a technical discipline (e.g., cloud, artificial intelligence, machine learning, mobile, etc.)\n \n  Preferred qualifications, capabilities, and skills\n  \n \n  Familiarity with modern front-end technologies \n  Exposure to cloud technologies\n  ABOUT US\n \n   \n  JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.  We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n \n  \n  \n  ABOUT THE TEAM\n  \n  The Corporate & Investment Bank is a global leader across investment banking, wholesale payments, markets and securities services. The world’s most important corporations, governments and institutions entrust us with their business in more than 100 countries. We provide strategic advice, raise capital, manage risk and extend liquidity in markets around the world."
    },
    {
        "company": "HERE Technologies",
        "description": "What's the role?: \n  As a Senior Software Engineer in the Foundation Engineering you will work self-sustained in an agile team. Your responsibilities will cover developing, extending, and maintaining algoirthms, tool and services that process data for HERE’s global databases.\n  \n Your Tasks\n \n   Develop and evaluate new algorithms to enhance places with more richer and accurate attributes.\n   Implement tools to enhance automated place processing systems, involving backend/service-based software stacks, but also dashboard components for data tracking and analysis.\n   Own and drive technical excellence and in-depth solutions in an innovative and fast-paced environment\n   Apply and extended CI/CD tools and execute end-2-end ownership of your developed software stack, including DevOps and testing aspects\n   Work with other engineering teams and internal customers to identify new opportunities, address critical needs, and solve complex problems using your backend development expertise\n   Drive initiatives that contribute in development of software that is efficient, re-usable and reliable (e.g. agile, coding, verification)\n   Be part of an agile team, share knowledge, carry out code reviews\n  Who are you?:\n  \n \n \n   Bachelor's or master’s degree in Computer Science/Information Systems or equivalent\n   4+ years of software development experience, \n  Excellent applied skills in Java and/or Scala programming, data structures, and algorithms.\n   Strong and applied experience in REST-based web service technologies, JSON and XML, SOA, and microservices architectures\n   Strong and applied DBMS & SQL skills, with a strong preference for PostgreSQL / PostGIS\n   Familiarity with AWS skills (EC2, S3, RDS)\n   Good knowledge of using issue tracking tools (e.g., JIRA), code collaboration tools (e.g., Git/GitLab), and team collaboration tools (e.g., Confluence/Wiki).\n   Good knowledge of Linux/Unix – familiar with shell scripting\n   Able to translate business and architectural features into quality, consistent software design\n   Solid knowledge of programming practices, striving to write great code that is reusable, flexible, and reliable.\n   Strong quality mindset is considered a must: unit testing, performance testing, writing testable code\n   Self-motivated, well-organized, details-oriented, and a strong team player with an agile mindset\n \n  HERE is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, age, gender identity, sexual orientation, marital status, parental status, religion, sex, national origin, disability, veteran status, and other legally protected characteristics.\n  \n  Who are we?: \n \n   HERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes – from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.\n \n \n \n   At HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity, and foster inclusion to improve people’s lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us. Watch Video"
    },
    {
        "company": "JPMorgan Chase & Co",
        "description": "JOB DESCRIPTION\n  We have an exciting and rewarding opportunity for you to take your software engineering career to the next level.\n  As a Software Engineer III - Java Full Stack Developer + AWS at JPMorgan Chase within the Corporate & Investment Bank Markets Technology Team, you will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You’ll work in a collaborative, trusting, thought-provoking environment—one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.\n  Job Responsibilities\n  \n  Follow modern SDLC practices and automated build test and deployment. \n  Create high quality scalable and resilient software to advance the business. \n  Work with data services team to identify sources of data for application. \n  Partner with supporting Tech leads, Quality Assurance and Production Management. \n  Provide L3 Support of the application. \n  Proactively look to develop, implement development best practices across the group. \n  Complete tasks independently and provide regular status update. \n  Guide junior members in the team.\n \n  Required qualifications, capabilities, and skills\n  \n  Formal training or certification on software engineering concepts and 3+ years applied experience \n  Strong analytical, problem solving, written and verbal communication skills. \n  Experience in core Java and J2EE frameworks and Hands on experience of Amazon web services \n  Hands on experience of Spring/Hibernate and various Apache libraries. \n  Hands on experience of big data technologies like Spark and Kafka \n  Development experience with micro services. \n  Experience with Messaging, XML and Integration patterns. \n  ORM, RDMS concepts with hands on experience on Oracle DB. \n  Good understanding of Linux environment and shell scripting. \n  Experience with Maven, Jira, GIT and CI Tools and Test Driven Development \n  Hands on experience with Amazon web services\n \n  Preferred qualifications, capabilities, and skills \n \n  Bachelor’s degree preferred in computer science, IT or related fields. \n  Application development experience. \n  Experience of working in Agile/SCRUM/Kanban development environments. \n  Have an agile mindset and a broad skillset - willing to do whatever it take to help the team deliver. \n  Excellent team spirit and ability to work in collaborative environment. \n  Experience with other Cloud Technologies (Docker, Kubernetes, Blue/Green Deployment). \n  Experience with UI technology like ReactJS, ExtJS, Node.js, Angular JS, HTML5, JavaScript\n \n  ABOUT US\n \n   \n  JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.  We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n \n  \n  \n  ABOUT THE TEAM\n  \n  The Corporate & Investment Bank is a global leader across investment banking, wholesale payments, markets and securities services. The world’s most important corporations, governments and institutions entrust us with their business in more than 100 countries. We provide strategic advice, raise capital, manage risk and extend liquidity in markets around the world."
    },
    {
        "company": "HCL Technologies",
        "description": "Technical Specialist \n  \n  \n   \n    Mumbai \n   \n  \n  \n   \n    2.5-5 Years \n   \n  \n  \n   \n    INDIA \n   \n  \n  \n   Job Description (Posting). \n   \n    Roles & Responsibilities:\n     \n     Monitoring and troubleshooting of LAN / W- Good knowledge on DHCP / DNS and other networking protocols.\n     Monitor, troubleshoot, and escalate production problems affecting network infrastructure\n     Hands on experience on network monitoring tools like ITSM Remedy is desirable\n     Co-ordinating with Carriers and working on troubleshooting on WAN links. Escalating issues at carrier end and driving issues till resolution\n     Troubleshoot and resolve telco issues resolution to be driven by engineer\n     Troubleshoot, and escalate production problems affecting network infrastructure\n     Troubleshooting IPSEC,NAT,PAT,GRE\n     \n     Required Skills\n     \n     Good Communication skill required\n     Advanced understanding in configuring and troubleshooting Routing protocols like RIP, EIGRP, OSPF, ISIS and BGP\n     Knowledge of QOS and multicasting required\n     Should have experience in troubleshooting complex network issues\n     Experience in troubleshooting LAN technologies like VTP , STP\n     Understanding of Gateway redundancy protocols like HSRP, VRRP, GLBP\n     Complete Understating of Small scale routers and switches such as 2800 , 2900, 3750 , 3900, ASR, ISR\n     Should have understanding of GRE, IPsec, site to site VPN, DMVPN\n     Understanding of VSS.\n     Understanding and troubleshooting LAN wireless issues, WLC, IOS upgrade on routers and switches\n     Understanding and troubleshooting MPLS, Frame Relay\n     Hands on experience on network monitoring tools like ITSM Remedy etc \n     Hands on experience in Circuit testing required\n     Should have Hardware knowledge on devices like 7600,6500,Nexus Series, 3750 etc...\n     Ready to work in 24 7 environment.\n     \n     Education & Experience:\n     \n     Btech/Mtech qualified (favourable - IT, Computer Science, Electrical Engineering).\n     CCNA Routing & Switching (mandatory)\n     4 9 years of experience in a technical network engineering role\n     (1.) To ensure that callsor chats are addressed within agreed SLAs (2.) To resolve escalations in a timely manner adhering to the process and quality compliance (3.) To maintain attendance, leave reports , breaks and shift rosters (4.) To update knowledge base through accurate documentation and disseminating knowledge from analyses and reports prepared to team for facilitating effective performance of responsibilities (5.) To perform adhoc analyses, SIP activities and infrastructure management (6.) To ensure postive customer satisfaction and feedback\n    \n  \n  \n   Qualification \n   \n    B-Tech \n   \n  \n  \n   No. of Positions \n   \n    1\n    \n  \n  \n   Skill (Primary) \n   \n    Data Center-Network Data-Network Data \n   \n  \n  \n   Auto req ID \n   \n    1386680BR"
    },
    {
        "company": "Upstox",
        "description": "The Upstox Story:\n \n \n \n   Upstox is one of India's leading Fin-Tech companies with a mission to simplify trading & investing to make it easily accessible to the masses. We aim to enable everyone, from new investors to seasoned traders, to invest across multiple categories with our state-of-the-art trade & investment platform and commission-free pricing. We offer numerous asset categories to invest in, like Stocks, Digital Gold, IPOs, Mutual Funds, and more.\n \n \n \n   By focusing on our customers’ needs and equipping them with personalized yet powerful tools, we witnessed a steep growth of 800% in our customer base from 25 Thousand in 2017 to 2 Lakh in 2019. With 1500% growth in 2020, currently, over 3 million customers trust us with their investment decisions, thus setting us on the course to become an industry-leader in the country.\n \n \n \n   Our mission is simple - to break down the complexities of investing and make it more effortless, accessible, affordable, and easy for the masses to adopt. This key principle when infused with intuitive design and leading-edge technology will help us empower every Indian to take control of their investments.\n \n \n \n   RKSV Securities was founded by Ravi Kumar and Shrinivas Viswanath in 2009 and was soon graced by Kavitha Subramanian as the third co-founder in 2016. Backed by Ratan Tata, Upstox had raised $4 million in Series A funding in early 2016 that was led by Kalaari Capital. The Series B funding round scaled multifold and witnessed an investment of $25 million by US-based investment firm - Tiger Global Management in September 2019.\n \n \n \n   Role: Quality Assurance Engineer I\n \n \n \n   We are looking for a Manual cum Automation Development Engineer. The successful candidate will help in creating frontend test scripts and run in a batch daily to verify the assigned Upstox product / Module end to end. Candidate also need to analyse automation test results and share across. The framework is based on Python and PyTest. This is a fast paced environment where the speed of Development and execution are paramount. Candidate will initially have to work on manual testing tasks to understand the product / domain, then to pitch in for automation on a need basis. This position needs to be very fluent in the manual testing process and take the production releases with the highest quality.\n \n \n \n   Responsibilities and Duties:\n \n \n   Test software to ensure responsiveness and efficiency.\n \n \n   Accurate test reporting to stakeholders and design process to improve test coverage.\n \n \n   Ensure that testability and quality are embedded throughout the software development and test life cycle.\n \n \n   Report issues as appropriate and follow up to get them to the closure.\n \n \n   Complete automation test, troubleshooting failure scripts and conduct test reports on time.\n \n \n   Keep improving the automation test efficiency and script ability.\n \n \n   Design automated test coverage strategies based on release requirements.\n \n \n   Participate in peer reviews for test cases, design and code implementation.\n \n \n \n   Qualifications: Overall 1-3 yrs experience.\n \n \n \n   Experience in manual testing process, creating highly effective test cases using different testing techniques and expert in system, integration and regression testing.\n \n \n   Having experience/Knowledge in developing automation scripts in Java or JUnit and TestNG, or any other equivalent language and framework.\n \n \n   Experience / knowledge in working in Scrum - agile methodologies, coding standards, code reviews, source management, and build processes (CI/CD Pipeline).\n \n \n   Ability to troubleshoot and think out of the box while writing test cases.\n \n \n   Experience or knowledge with debugging tools like Fiddler, Charles Proxy, Jenkins, Selenium, Android Studio/Xcode, TestNG tools.\n \n \n   Experience or knowledge with tools like Jira, Xray, Confluence\n \n \n   Ability to analyse the production issues and able to simulate defects by creating required test data.\n \n \n   Good read and written English communication skills and good team player.\n \n \n   Self motivated, persistent, fast learner and innovative.\n \n \n \n   Preferred Qualifications:\n \n \n   Having experience or knowledge in Trading and the FinTech domain is an added plus.\n \n \n   Having experience/knowledge in Web applications.\n \n \n   Having flexibility in switching responsibilities between Manual and Automation.\n \n \n   Having knowledge on RESTFul services"
    },
    {
        "company": "HERE Technologies",
        "description": "What's the role?: \n \n   The HERE indoor team works with the full stack of the HERE indoor maps product ranging from the tooling used by the map experts and customers to the content delivery mechanisms implemented on top of the HERE Platform. We also provide means to the indoor map consumption in mobile, web, autonomous vehicles and support various data products. We have a full team with frontend and backend developers, test automation experts, devops and data engineers. We are based in Mumbai and have a good mix of people that can coach new joiners.\n \n \n   Following our company values “Learn Fast” and “Win Together”, we collaborate with external partners and other teams within HERE to ensure that our customers always get best of technology and services for their everyday use and to support their business.\n \n \n   The HERE Indoor Map team is responsible for taking the next step in the indoor map making – automating the indoor map generation using LIDAR and high-resolution imagery as the starting point. From this survey data we will generate indoor maps to human and autonomous vehicle consumption using machine learning, big data processing methods and artificial intelligence.\n \n \n   We are now looking for a data scientist or data engineer in our automation team. In this role you will be\n \n \n   Analyzing data, designing new algorithms and models\n   Developing and supporting indoor map automation pipelines\n   Building and scaling the automation deployments in cloud environments\n   Collaborating in cross-functional team of data scientists, developers, devops and quality engineers\n   Continuously looking for best practices, looking out for the next best thing\n  Who are you?: \n \n   Requirements\n \n \n   Minimum of 1 year of relevant professional experience\n   Experience with ML / AI related projects\n   Experience working in an Agile development environment\n   Experience in E2E software development lifecycle - from requirement gathering to deployments\n   Proficiency in Python\n   Good communication skills, both written and verbally\n   Previous knowledge of computer vision, point clouds, object detection is a big bonus\n   Good to have : geospatial knowledge\n \n \n   HERE is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, age, gender identity, sexual orientation, marital status, parental status, religion, sex, national origin, disability, veteran status, and other legally protected characteristics.\n  Who are we?: \n \n   HERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes – from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.\n \n \n \n   At HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity and foster inclusion to improve people’s lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us on our YouTube Channel."
    },
    {
        "company": "NTT",
        "description": "NTT is a leading global IT solutions and services organisation that brings together people, data and things to create a better and more sustainable future.\n  In today’s ‘iNTTerconnected’ world, connections matter more now than ever. By bringing together talented people, world-class technology partners and emerging innovators, we help our clients solve some of the world’s most significant technological, business and societal challenges.\n  With people at the heart of our success, NTT is committed to attracting and growing the best talent and providing an environment where everyone feels they can belong and their contribution matters.\n \n  Want to be a part of our team? The Associate Database Administrator is an entry level role within the Database Administrating job family. Under the supervision of more experienced Database Administrator team members, this role assists in daily database administration tasks such as database monitoring, backup and recovery, user management, and data maintenance. This role will also assist with the installation, configuration, monitoring, optimization, and security of less complex database systems.\n  \n  The Associate Database Administrator works closely with Change Control, Release Management, Asset and Configuration Management and Capacity and Availability Management to establish the needs of users, monitoring user access and security. This role assists in controlling access to databases environments through permissions and privileges.\n \n  Working at NTT\n  Key Roles and Responsibilities:\n \n   Assists with the installation, configuration, and maintenance of database management systems (DBMS), including SQL Server, Oracle, MySQL, or others, as required.\n   Collaborates with software developers/architects to design and optimize database schemas, data models, and database-related applications.\n   Works with general direction from the client, stakeholders, team lead, or senior manager, to perform operational tasks to resolve all escalated incidents/requests in a timely manner within the agreed SLA Provides timely and consistent updates of tickets with resolution tasks performed\n   Assists with the mapping out of the conceptual design for a planned database.\n   Participates in the writing of database documentation, including data standards, data flow diagrams, standard operating procedures and definitions for the data dictionary (metadata).\n   Creates, tests and executes data management languages.\n   Monitors database performance, identifies performance bottlenecks, and optimizes queries and indexing for optimal database performance.\n   Continuously monitors database systems to ensure availability, proactively identify potential issues, and takes appropriate actions.\n   Designs and implements robust backup and disaster recovery strategies to ensure data availability and business continuity.\n   Monitors production databases regularly or respond to any database issues by bringing down the database or taking the database offline.\n   Proactively supports the development of database utilities and automated reporting.\n   Sets up data sharing and disk partitioning.\n   Works closely with the Change Control and Release Management functions to commission and install new applications and customising existing applications in order to make them fit for purpose.\n   Plans and executes database software upgrades and applies patches to keep systems up-to-date and secure.\n   Communicates regularly with technical, applications and operational employees to ensure database integrity and security.\n   Implements and manages security measures to safeguard databases from unauthorized access, data breaches, and data loss.\n   Maintains data standards in accordance with business requirements, NTT policies and the data protection legislations\n   Ensures data integrity and consistency by performing regular data validation, integrity checks, and data cleansing activities.\n   Conducts regular security audits and vulnerability assessments to maintain compliance with data protection standards and regulations.\n   Works collaboratively with cross-functional teams, including developers, system administrators, network engineers, and business stakeholders, to support database-related initiatives.\n   Provides technical support to end-users, assists with database-related enquiries, and conducts training sessions as needed.\n \n  Knowledge, Skills and Attributes:\n \n   Proficiency in database administration tasks, including database installation, configuration, maintenance, and performance tuning\n   Knowledge of SQL (Structured Query Language) to write less complex queries, stored procedures, and functions\n   Understanding of database security principles, access controls, and data encryption methods\n   Working knowledge in database backup and recovery strategies to ensure data availability and business continuity\n   Ability to monitor database performance, identify and resolve issues, and optimize database operations\n   Familiarity with data modelling techniques and database design principles to support data-driven applications\n   Ability to maintain a high level of attention to detail on each project\n   Ability to learn new technologies as needed to provide the best solutions to all stakeholders\n   Ability to collect, organise, disseminate and present significant amounts of information\n   Ability to communicate IT information in simplified form depending on the target audience\n   Effective communication and collaboration skills to work with cross-functional teams and stakeholders\n   Understanding of the principles of data architecture and data services\n   Knowledge of application development lifecycle and data access layers\n   Demonstrate the ability to plan and organise\n   Good problem-solving skills to troubleshoot database-related issues and implement effective solutions\n   Good analytical skills related to working with unstructured datasets\n   Ability to manipulate, process and extract value from large, disconnected datasets\n   Good documentation skills to maintain comprehensive database documentation and data dictionaries\n   Ability to handle multiple tasks, set priorities, and meet deadlines in a dynamic IT environment\n \n  Academic Qualifications and Certifications:\n \n   Bachelor’s degree or equivalent in computer science, engineering, information technology or related field\n   Relevant certification, such as MCSE DBA, oracles associate or equivalent\n   Relevant certifications such as Microsoft Certified: Azure Database Administrator Associate; Oracle Certified Professional (OCP) - Database Administrator; MySQL Database Administrator; PostgreSQL Certified Professional\n   Completion of database management courses covering topics like database administration, data modelling, SQL, and performance tuning can provide foundational knowledge\n \n  Required Experience:\n \n   Entry level experience working as a Database Administrator within an Information Technology organisation\n   Entry level experience with database backup and recovery best practices\n   Entry level experience running and creating health assessment reports\n   Entry level experience working with suppliers to deliver solutions\n   Entry level experience in Oracle Enterprise\n   Entry level experience in Microsoft SQL Server\n   Entry level experience managing databases\n \n \n  Skills Summary Database Design, Database Management Systems (DBMS), Database Systems, Data Migrations, Process Optimization, Recovery Management, Scripting\n \n  Workplace type: Hybrid Working\n \n  Equal Opportunity Employer\n  NTT is proud to be an Equal Opportunity Employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, color, sex, religion, national origin, disability, pregnancy, marital status, sexual orientation, gender reassignment, veteran status, or other protected category\n  Join our growing global team and accelerate your career with us. Apply today.\n \n  \n   \n    \n     \n      \n       \n        \n          A career at NTT means:\n         \n           Being part of a global pioneer – where you gain exposure to our Fortune 500 clients and world-leading global technology partners and work with a network of over 40,000 smart and diverse colleagues across 57 countries, delivering services in over 200 countries.\n           Being at the forefront of cutting-edge technology – backed with a 150-year heritage of using technology for good. With 40% of the world’s internet traffic running on our network and where Emoji were first invented, you can be proud of the group’s many new ‘firsts’.\n           Making a difference – by doing meaningful work that helps to shape the future for our clients, and across industries and communities around the world. \n          Being your best self – in a progressive ‘Connected Working’ environment that promotes flexibility, connection and wellbeing. Where diversity and different perspectives are embraced to ensure equal opportunities for all.\n           Having ongoing opportunities to own and develop your career – with a personal and professional development plan and access to the broadest learning offerings in the industry."
    },
    {
        "company": "JPMorgan Chase & Co",
        "description": "JOB DESCRIPTION\n  The Associate, Pay & Time Engineering will be a part of the Workforce Technology organisation and will lead the modelling and development of automated reconciliation (and select other automation) solutions for the HR function globally. The role acts as a subject matter specialist for process improvement and innovation efforts, identifying prospective automation opportunities and delivering the technology solutions, with a special emphasis on Alteryx based reconciliation solutions. The role reports to the HR / Workforce Technology Engineering Solutions Lead (Global).\n  As a Software Engineer II at JPMorgan Chase, you are part of an agile team that works to enhance, design, and deliver the software components of the firm’s state-of-the-art technology products in a secure, stable, and scalable way. As an emerging member of a software engineering team, you execute software solutions through the design, development, and technical troubleshooting of multiple components within a technical product, application, or system, while gaining the skills and experience needed to grow within your role.\n  Job responsibilities\n  \n  Works with HR process leads / operations managers to identify automation opportunities and develop appropriate technology solutions \n  The initial focus area of this role will be to assess needs / opportunities, finalise requirements, design and implement automated reconciliation solutions using Alteryx Designer (or similar tools) \n  The role holder may also be assigned to work on solutions employing Pega, UIPath and other Automation tools under the Engineering Solutions purview \n  Supports design of process maps and end-user documentation (BRDs / SDDs) \n  Actively coaches and trains teams on associated process and technology change and drives adoption\n \n  Required qualifications, capabilities, and skills\n  \n  Formal training or certification on software engineering concepts and 2+ years applied experience \n  3-6 years of Data Transformation, Automation, Robotics, Business Process Analysis experience with a proven track record of process improvement and automation projects preferably in the field of HR \n  Strong preference for competent users of Alteryx Designer – Core / Advanced Certifications will be given consideration \n  Knowledge of Python and experience with other automation tools like Pega, UiPath would be a plus \n  Understanding / experience of AI / ML, AWS, Databricks are good to have (but not mandatory) \n  Experience developing and designing current state and future state process maps \n  Competent (Intermediate-Advanced to Advanced) level MS Office user \n  Experience of sourcing and writing data from and to Relational databases and files using automation tools and SQL query experience, knowledge of Programming languages would be useful but are not pre-requisites \n  Can think creatively and looks for innovative solutions to problems \n  Strong communication skills with the ability to coach, train and support other and demonstrable project management skills\n \n  Required qualifications, capabilities, and skills\n  \n  Ability to think critically about a process and determine repetitive and rules driven components \n  The role holder will be assessed on logical approach to problem solving and ability to translate a logical problem into a technological / improvement solution and also the ability to work with and influence a wide variety of stakeholders \n  Btech Background preferred\n  ABOUT US\n \n   \n  JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.  We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n \n  \n  \n  ABOUT THE TEAM\n  \n  Our professionals in our Corporate Functions cover a diverse range of areas from finance and risk to human resources and marketing. Our corporate teams are an essential part of our company, ensuring that we’re setting our businesses, clients, customers and employees up for success."
    },
    {
        "company": "Spinnaker Analytics",
        "description": "Profile Overview\nWe're seeking talented Data/ML-Ops Engineers to join our team. In this role, you'll play a key part in the data lifecycle, transforming raw data into valuable insights for data analysis and machine learning projects. You'll design and build data pipelines, ensuring data quality and collaborating closely with data scientists and business users.\nResponsibilities\n\n Analyze raw data, identify and address quality issues (completeness, duplicates, outliers) using SQL, Python libraries (Pandas, NumPy), and other data manipulation tools.\n Design, develop, and maintain data pipelines for data extraction, transformation, and loading (ETL)\n Perform data integrity checks and automate manual data processes for efficiency.\n Utilize statistical analysis and data visualization methods to explore data and prepare it for modelling.\n Deliver data sets in formats suitable for machine learning algorithms used by data scientists.\n Collaborate with data scientists and business users to understand data structures, variables, and systems.\n Troubleshoot data-related technical issues with data analysts and business teams.\n Define user access and ensure data distribution to the right users in the appropriate format and timeframe.\n\nTechnical Skills & Requirements\n\n Essential:\n 3+ years of experience in data manipulation and wrangling for analytics.\n Proficiency in SQL (including stored procedures) or NoSQL databases.\n Strong understanding of data structures and design principles.\n Experience with Python libraries for data manipulation (Pandas, NumPy, etc.)\n Experience with Azure cloud tools like Azure Data Factory, Synapse, etc. and the medallion lakehouse architecture.\n Experience in containerizing solutions for CI/CD (Continuous Integration/Continuous Deployment) flows using Azure Containers, Kubernetes, Docker etc.\n\n\n Desirable:\n Certification in MS SQL or a similar data warehousing or data management solution (SSIS/SSRS/SSAS).\n Familiarity with cloud platforms (AWS, GCP, Azure) a plus.\n Experience with data warehousing concepts and tools.\n Knowledge of data version control systems (e.g., Git).\n\nSoft Skills\n\n Excellent collaboration skills to work effectively with data scientists, analysts, and business users.\n Positive and proactive approach to problem-solving.\n Strong communication skills to explain technical concepts to non-technical audiences.\n\nJob Type: Full-time\nPay: ₹600,000.00 - ₹1,000,000.00 per year\nBenefits:\n\n Paid sick time\n\nSchedule:\n\n Day shift\n Monday to Friday\n\nSupplemental pay types:\n\n Yearly bonus\n\nApplication Question(s):\n\n Would you be able to commute to Andheri ?\n\nExperience:\n\n total work: 3 years (Required)\n\nWork Location: In person"
    }
]