[
    {
        "company": "IBM",
        "description": "Introduction\n  Information and Data are some of the most important organizational assets in today’s businesses. As a Security Consultant, you will be a key advisor for IBM’s clients, analyzing business requirements to design and implement the best security solutions for their needs. You will apply your technical skills to find the balance between enabling and securing the client's organization with the cognitive solutions that are making IBM the fastest growing enterprise security business in the world.\n  \n  Your Role and Responsibilities\n  As the DLP & DAM Engineer, your responsibilities will include, but are not limited to, the following:\n \n   Hands-on experience of DLP technology across a large enterprise.\n   Experience in DLP security solutions covering Symantec DLP Endpoint, Discover, Web & Email.\n   Expertise on design and implementation of DLP policies.\n   Expertise to fine-tune DLP policies to reduce false detection.\n   Provide advice on Data Leakage Policy development.\n   Administration of the DLP tools to include configuration of policies, upgrading, patching etc.\n   Experience to troubleshoot Symantec DLP issues related to DLP Architecture, Services & Agents.\n   Monitor and respond to alerts generated from the DLP systems and other technologies.\n   Understand and follow the incident response process through event escalations.\n   Collaborate with business groups to help them identify, classify and secure high value data.\n   Sound knowledge of DLP versions, patching and other initiatives for system upgradation.\n   Implementation of proactive measures to enhance accuracy and effectiveness of DLP tools.\n   Good communication skills to discuss with various stakeholders with respect to collaborations, handling issues etc.\n   Understanding of DAM Monitoring & Operations with respect to Policies, upgrading & patching\n   Experience in troubleshooting Agent Integrations issues.\n   Knowledge of handling File Integrity Monitoring (FIM) events & take action accordingly. \n  Understanding of Tripwire Baselining with respect to MBSS and Industry standards.\n   Understanding of OS, DB and Middleware baselines & implementing policies accordingly.\n   Good understanding of organizational network architecture Experience in maintaining various metrices and SLAs\n  What you’ll do: \n  \n  How we’ll help you grow:\n  You’ll have access to all the technical and management training courses you need to become the expert you want to be\n  You’ll learn directly from expert developers in the field; our team leads love to mentor\n  You have the opportunity to work in many different areas to figure out what really excites you\n  \n  Required Technical and Professional Expertise\n  Minimum of 3 years of relevant experience .\n \n   Hands-on experience of DLP technology across a large enterprise.\n   Good troubleshooting abilities.\n   Technical documentation abilities.\n   Understanding of HLD & LLD.\n   Manage escalations and run the smooth operations of security solutions\n   Vendor Management – manage periodic MIS & SLAs reviews, payments & penalties, renewal of support contracts and licenses in timely manner\n   Publish the relevant MIS, dashboards, and status updates to all stake holders\n   Preferably with Banking domain experience\n   Troubleshooting and problem-solving skills\n   Strong Incident Handling capabilities and Fundamental of Forensics\n   Sound knowledge & understanding of security operations, processes, and various security technologies\n \n  Preferred Technical and Professional Expertise\n  Symantec DLP, Zsclater DLP, Imperva DAM\n \n   Understanding of Tripwire Baselining with respect to MBSS and Industry standards.\n   One or more security certifications.\n   Ambitious individual who can work under their own direction towards agreed targets/goals and with creative approach to work\n   Intuitive individual with an ability to manage change and proven time management\n   Proven interpersonal skills while contributing to team effort by accomplishing related results as needed\n   Up-to-date technical knowledge by attending educational workshops, reviewing publications\n \n  About Business UnitIBM Consulting is IBM’s consulting and global professional services business, with market leading capabilities in business and technology transformation. With deep expertise in many industries, we offer strategy, experience, technology, and operations services to many of the most innovative and valuable companies in the world. Our people are focused on accelerating our clients’ businesses through the power of collaboration. We believe in the power of technology responsibly used to help people, partners and the planet.\n  This job requires you to be fully COVID-19 vaccinated prior to your start date and proof of vaccination status will be required before your start date. During the Onboarding process you will be asked to confirm your vaccination status, in case you are unable to get vaccinated for any reason, you can let us know at that stage. Please let us know if you are unable to be vaccinated due to medical or religious reasons. IBM will consider such requests on a case by case basis subject to submission of required proof by the candidate before a stipulated date.\n  Your Life @ IBMIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n  Being an IBMer means you’ll be able to learn and develop yourself and your career, you’ll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n  Our IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n  Are you ready to be an IBMer?\n  About IBMIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n  \n  Location StatementWhen applying to jobs of your interest, we recommend that you do so for those that match your experience and expertise. Our recruiters advise that you apply to not more than 3 roles in a year for the best candidate experience.\n  \n  For additional information about location requirements, please discuss with the recruiter following submission of your application.\n  \n  Being You @ IBMIBM is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, caste, genetics, pregnancy, disability, neurodivergence, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."
    },
    {
        "company": "Accelya",
        "description": "For more than 40 years, Accelya has been the industry’s partner for change, simplifying airline financial and commercial processes and empowering the air transport community to take better control of the future. Whether partnering with IATA on industry-wide initiatives or enabling digital transformation to simplify airline processes, Accelya drives the airline industry forward and proudly puts control back in the hands of airlines so they can move further, faster.\n \n \n \n   Role Purpose:\n   \n   As a senior developer, you will direct the development and execution of codes, strategies and action plans. You will plan and direct. The successful candidate will need to for creating and maintaining the user interface of web and mobile applications using Angular, a popular front-end framework.\n \n \n \n   This position will be responsible for web development. The focus will be on designing Interfaces in line with Accelya´s global business strategy, values and missions.\n   \n   Duties And Responsibilities:\n \n \n  \n   \n     Develop, maintain, and enhance user interfaces for web applications using Angular latest version. Write clean, maintainable, and efficient code.\n   \n  \n   \n     Collaborate closely with designers, back-end developers, and other team members to integrate UI components into the application, ensuring a seamless user experience.\n   \n  \n   \n     Create responsive and cross-browser-compatible UIs that work well on a variety of devices and browsers.\n   \n  \n   \n     Integrate with RESTful APIs and handle data retrieval, storage, and synchronization in a user-friendly manner.\n   \n  \n   \n     Collaborate with product managers and stakeholders to understand and refine project requirements and user stories.\n   \n \n \n   Knowledge, Experience and Skillsets:\n \n \n  \n   \n     Proven experience as a UI developer with in-depth knowledge of Angular and TypeScript.\n   \n  \n   \n     Experience with CSS pre-processing tools like SASS or LESS.\n   \n  \n   \n     Familiarity with RESTful API integration and asynchronous programming.\n   \n  \n   \n     Experience with version control systems, especially Git.\n   \n  \n   \n     Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience).\n   \n  \n   \n     A strong portfolio showcasing past projects and UI development work is a plus\n   \n \n \n   What do we offer?\n \n \n  \n   \n     Open culture and challenging opportunity to satisfy intellectual needs\n   \n  \n   \n     Flexible working hours\n   \n  \n   \n     Smart working: hybrid remote/office working environment\n   \n  \n   \n     Work-life balance\n   \n  \n   \n     Excellent, dynamic and multicultural environment\n   \n \n \n   About Accelya:\n \n \n   Accelya is a leading global software provider to the airline industry, powering 200+ airlines with an open, modular software platform that enables innovative airlines to drive growth, delight their customers and take control of their retailing.\n \n \n   Owned by Vista Equity Partners long-term perennial fund and with 2K+ employees based around 10 global offices, Accelya are trusted by industry leaders to deliver now and deliver for the future.\n \n \n   The company´s passenger, cargo, and industry platforms support airline retailing from offer to settlement, both above and below the wing. Accelya are proud to deliver leading-edge technologies to our customers including through our partnership with AWS and through the pioneering NDC expertise of our Global Product teams.\n \n \n   We are proud to enable innovation-led growth for the airline industry and put control back in the hands of airlines.\n \n \n   For more information, please visit www.accelya.com\n \n \n \n   What does the future of the air transport industry look like to you? Whether you’re an industry veteran or someone with experience from other industries, we want to make your ambitions a reality!"
    },
    {
        "company": "TheMaverics Technologies",
        "description": "Job Summary\n    Power BI developers are responsible for the development and administration of BI tools. They need to have complete knowledge of the Power BI system. The main duty of Power BI developers is to convene raw data into meaningful analysis with the help of interactive and easy to understand dashboards and reports.\n    Experience\n    3+ Years\n    Location\n    Mumbai\n    Job Category\n    Full Time Job, IT, Cloud engineer\n    Job Description\n    Responsibilities\n    1.Power BI development and administration.\n    2. Building Analysis Services reporting models.\n    3. Developing visual reports, dashboards and KPI scorecards using Power BI desktop.\n    4. Connecting to data sources, importing data, and transforming data for Business Intelligence.\n    5. Excellent in analytical thinking for translating data into info native visuals and reports.\n    6. Able to implement row level security on data and have an understanding of application security layer models in Power BI\n    7. Expertise in using advance level calculations on the data set.\n    8. Responsible for design methodology and project documentation.\n    9. Able to develop tabular and multidimensional models that are compatible with warehouse standards.\n    10. Adept in developing, publishing and scheduling Power BI replots as per the business Requirements.\n    11. Able to properly understand the business requirements and develop data models accordingly by taking care of the resources.\n    Requirements\n   \n     Development experience in Microsoft 365 technologies including SharePoint Online and the Power Platform (PowerApps, Power Automate, Power BI)\n     SharePoint/Power Platform related certification\n     Troubleshooting abilities\n     Ability to learn new emerging technologies.\n     Excellent communication skills (written as well as Verbal)\n   \n    Qualification\n   \n     Min 3+ years of experience with respect to Microsoft 365 technologies.\n     Good knowledge of Power Platform and related emerging Technologies.\n     BE, BSc in Computer Science, or relevant field.\n   \n    Microsoft Certifications\n    SharePoint related certifications and PL-900 would be an added advantage.\n    Certification is not mandatory, and TMTPL can provide training for the same."
    },
    {
        "company": "HCL Technologies",
        "description": "ASSOCIATE CONSULTANT \n  \n  \n   \n    Mumbai \n   \n  \n  \n   \n    4.5-8 Years \n   \n  \n  \n   \n    INDIA \n   \n  \n  \n   Job Description (Posting). \n   \n    Roles & Responsibilities:\n     \n     Monitoring and troubleshooting of LAN / W- Good knowledge on DHCP / DNS and other networking protocols.\n     Monitor, troubleshoot, and escalate production problems affecting network infrastructure\n     Hands on experience on network monitoring tools like ITSM Remedy is desirable\n     Co-ordinating with Carriers and working on troubleshooting on WAN links. Escalating issues at carrier end and driving issues till resolution\n     Troubleshoot and resolve telco issues resolution to be driven by engineer\n     Troubleshoot, and escalate production problems affecting network infrastructure\n     Troubleshooting IPSEC,NAT,PAT,GRE\n     \n     Required Skills\n     \n     Good Communication skill required\n     Advanced understanding in configuring and troubleshooting Routing protocols like RIP, EIGRP, OSPF, ISIS and BGP\n     Knowledge of QOS and multicasting required\n     Should have experience in troubleshooting complex network issues\n     Experience in troubleshooting LAN technologies like VTP , STP\n     Understanding of Gateway redundancy protocols like HSRP, VRRP, GLBP\n     Complete Understating of Small scale routers and switches such as 2800 , 2900, 3750 , 3900, ASR, ISR\n     Should have understanding of GRE, IPsec, site to site VPN, DMVPN\n     Understanding of VSS.\n     Understanding and troubleshooting LAN wireless issues, WLC, IOS upgrade on routers and switches\n     Understanding and troubleshooting MPLS, Frame Relay\n     Hands on experience on network monitoring tools like ITSM Remedy etc \n     Hands on experience in Circuit testing required\n     Should have Hardware knowledge on devices like 7600,6500,Nexus Series, 3750 etc...\n     Ready to work in 24 7 environment.\n     \n     Education & Experience:\n     \n     Btech/Mtech qualified (favourable - IT, Computer Science, Electrical Engineering).\n     CCNA Routing & Switching (mandatory)\n     4 9 years of experience in a technical network engineering role\n     (1.) To independently resolve tickets and esnure that the agreed SLA of ticket volume and time are met for the team. (2.) To provide support for on call escalations orL3 level support and doing incident and problem management (3.) Work on value adding activities such Knowledge base update and management, Training freshers, coaching analysts and conducting interviewsorparticipation in hiring drives. (4.) To adhere to quality standards, regulatory requirements and company policies (5.) To ensure positive customer experience and CSAT through First Call Resolution and minimum rejected resolutions or Reopen Cases (6.) To participate or contribute on EN business in creation of proposals to drive Service improvement plans.\n    \n  \n  \n   Qualification \n   \n    B-Tech \n   \n  \n  \n   No. of Positions \n   \n    1\n    \n  \n  \n   Skill (Primary) \n   \n    Data Center-Network Data-Network Data \n   \n  \n  \n   Auto req ID \n   \n    1388245BR"
    },
    {
        "company": "NTT",
        "description": "NTT is a leading global IT solutions and services organisation that brings together people, data and things to create a better and more sustainable future.\n  In today’s ‘iNTTerconnected’ world, connections matter more now than ever. By bringing together talented people, world-class technology partners and emerging innovators, we help our clients solve some of the world’s most significant technological, business and societal challenges.\n  With people at the heart of our success, NTT is committed to attracting and growing the best talent and providing an environment where everyone feels they can belong and their contribution matters.\n \n  Want to be a part of our team? The Managed Services Cross Technology Engineer (L1) is responsible for providing a managed service to clients to ensure that their IT infrastructure and systems remain operational through proactively identifying, investigating, and resolving technical incidents and problems and restoring service to clients by managing incidents to resolution. Their primary objective is to ensure zero missed service level agreement conditions. The Managed Services Cross Technology Engineer (L1) focuses on first-line support for standard and low complexity incidents and service requests. This role focusses across two or more technology domains - Cloud, Security, Networking, Applications and / or Collaboration etc. \n  \n  This role may also contribute to / support on project work as and when required.\n \n  Working at NTT\n  Key Roles and Responsibilities:\n \n   Monitors client infrastructure and solutions\n   Identifies problems and errors prior to or when they occur\n   Routinely identifies common incidents and opportunities for avoidance as well as general opportunities for incident reduction\n   Investigates first line incidents assigned and identifies the root cause of incidents and problems\n   Provides telephonic or chat support to clients when required\n   Schedules maintenance activity windows for patching and configuration changes\n   Follows the required handover procedures for shift changes to ensure service continuity\n   Reports and escalates incidents where necessary\n   Ensures the efficient and comprehensive resolutions of incidents and requests\n   Updates existing knowledge articles or create new ones\n   Identifies opportunities for work optimization including opportunities for automation of work, request fulfilment, incident resolution, and other general process improvement opportunities\n   May also contribute to / support on project work as and when required\n   May work on implementing and delivering Disaster Recovery functions and tests\n \n  Knowledge, Skills and Attributes:\n \n   Ability to communicate and work across different cultures and social groups\n   Ability to plan activities and projects well in advance, and takes into account possible changing circumstances\n   Ability to maintain a positive outlook at work\n   Ability to work well in a pressurized environment\n   Ability to work hard and put in longer hours when it is necessary\n   Ability to apply active listening techniques such as paraphrasing the message to confirm understanding, probing for further relevant information, and refraining from interrupting\n   Ability to adapt to changing circumstances\n   Ability to place clients at the forefront of all interactions, understanding their requirements, and creating a positive client experience throughout the total client journey\n \n  Academic Qualifications and Certifications:\n \n   Bachelor's degree or equivalent qualification in IT/Computing (or demonstrated equivalent work experience)\n   Certifications relevant to the services provided (certifications carry additional weightage on a candidate’s qualification for the role)\n   Relevant certifications include:\n   \n     CCNA or relevant level 1 Network Security certification is good to have\n     Microsoft Certified: Azure Administrator Associate\n     AWS Certified: Solutions Architect Associate\n     Veeam Certified Engineer\n     VMware certified Professional: Data Centre Virtualization\n     Zerto, pure, vxrail\n     Google Cloud Platform (gcp)\n     Oracle Cloud Infrastructure (oci)\n   \n \n  Required Experience:\n \n   Entry-level experience with troubleshooting and providing the support required in security / network/ data centre/ systems/ storage administration and monitoring Services within a medium to large ICT organisation\n   Basic knowledge of management agents, redundancy concepts, and products within the supported technical domain (i.e. Security, Network, Data Centre, Telephony, etc.)\n   Basic knowledge of ITIL processes\n \n \n  Skills Summary Incident Resolution, Infrastructure Deployment, IT Infrastructure Support, IT Monitoring, Managed Services Delivery, Root Cause Analysis (RCA), Troubleshooting\n \n  Workplace type: On-site Working\n \n  Equal Opportunity Employer\n  NTT is proud to be an Equal Opportunity Employer with a global culture that embraces diversity. We are committed to providing an environment free of unfair discrimination and harassment. We do not discriminate based on age, race, color, sex, religion, national origin, disability, pregnancy, marital status, sexual orientation, gender reassignment, veteran status, or other protected category\n  Join our growing global team and accelerate your career with us. Apply today.\n \n  \n   \n    \n     \n      \n       \n        \n          A career at NTT means:\n         \n           Being part of a global pioneer – where you gain exposure to our Fortune 500 clients and world-leading global technology partners and work with a network of over 40,000 smart and diverse colleagues across 57 countries, delivering services in over 200 countries.\n           Being at the forefront of cutting-edge technology – backed with a 150-year heritage of using technology for good. With 40% of the world’s internet traffic running on our network and where Emoji were first invented, you can be proud of the group’s many new ‘firsts’.\n           Making a difference – by doing meaningful work that helps to shape the future for our clients, and across industries and communities around the world. \n          Being your best self – in a progressive ‘Connected Working’ environment that promotes flexibility, connection and wellbeing. Where diversity and different perspectives are embraced to ensure equal opportunities for all.\n           Having ongoing opportunities to own and develop your career – with a personal and professional development plan and access to the broadest learning offerings in the industry."
    },
    {
        "company": "Apexon",
        "description": "About Apexon:\n  Apexon is a digital-first technology services firm specializing in accelerating business transformation and delivering human-centric digital experiences. We have been meeting customers wherever they are in the digital lifecycle and helping them outperform their competition through speed and innovation.Apexon brings together distinct core competencies – in AI, analytics, app development, cloud, commerce, CX, data, DevOps, IoT, mobile, quality engineering and UX, and our deep expertise in BFSI, healthcare, and life sciences – to help businesses capitalize on the unlimited opportunities digital offers. Our reputation is built on a comprehensive suite of engineering services, a dedication to solving clients’ toughest technology problems, and a commitment to continuous improvement. Backed by Goldman Sachs Asset Management and Everstone Capital, Apexon now has a global presence of 15 offices (and 10 delivery centers) across four continents.\n  We enable #HumanFirstDIGITAL\n \n \n   Job title: Lead\n \n \n  Job Description\n  \n  7+ years experience in developing web applications using ReactJS, HTML5, JQuery, CSS3, NodeJs and JavaScript for UI components \n  Experience with PostgresExperience with user interface design \n  Thorough understanding of React.js and its core principles \n  Experience with popular React.js workflows \n  Experience with browser-based debugging and performance testing software \n  Experience with API integration \n  Experience with API testing using Postman \n  Experience with any API designing tool like Swagger\n \n \n  Our Commitment to Diversity & Inclusion:\n  Did you know that Apexon has been Certified™ by Great Place To Work®, the global authority on workplace culture, in each of the three regions in which it operates: USA (for the fourth time in 2023), India (seven consecutive certifications as of 2023), and the UK.Apexon is committed to being an equal opportunity employer and promoting diversity in the workplace. We take affirmative action to ensure equal employment opportunity for all qualified individuals. Apexon strictly prohibits discrimination and harassment of any kind and provides equal employment opportunities to employees and applicants without regard to gender, race, color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. You can read about our Job Applicant Privacy policy here Job Applicant Privacy Policy (apexon.com)\n  Our Perks and Benefits:\n  Our benefits and rewards program has been thoughtfully designed to recognize your skills and contributions, elevate your learning/upskilling experience and provide care and support for you and your loved ones. As an Apexer, you get continuous skill-based development, opportunities for career advancement, and access to comprehensive health and well-being benefits and assistance.\n  We also offer:\n  o Group Health Insurance covering family of 4\n  o Term Insurance and Accident Insurance\n  o Paid Holidays & Earned Leaves\n  o Paid Parental LeaveoLearning & Career Development\n  o Employee Wellness"
    },
    {
        "company": "Fractal Analytics",
        "description": "It's fun to work in a company where people truly BELIEVE in what they are doing!\n \n \n \n   We're committed to bringing passion and customer focus to the business.\n \n \n \n  \n    Engineer\n  \n  \n    at Fractal.ai\n  \n  \n    Location; Bangalore/Mumbai/Gurgaon, India\n  \n  \n    Brief about the Team & Fractal:\n  \n  \n    Fractal Analytics is Leading Fortune 500 companies leverage Big Data, analytics and technology to drive smarter, faster and more accurate decisions in every aspect of their business.\n  \n  \n    Fortune 500 companies recognize analytics is a competitive advantage to understand customers and make better decisions. We deliver insight, innovation, and impact to them through predictive analytics and visual storytelling.\n  \n  \n    Role Details\n  \n  \n    Section 1 (Roles and Responsibilities)\n  \n  \n    The person should have hands-on experience in working on Microservices based application using Python Flask/Django, React JS and deployed it into cloud (preferably using Google cloud services). The person should be able to design new webpages using React JS, HTML and CSS. He / she should be able to integrate UI with backend API and validate.\n  \n  \n  \n    The person should be able to guide and review for team members. The person should have the ability to provide solutioning to the problem statement given by the client.\n  \n  \n  \n    Section 2 (Mandatory technical skills)\n  \n  \n    Microservices, Python Django/ Flask, React JS, SQL\n  \n  \n  \n    Good to have:\n  \n  \n    Google cloud service, Kubernetes\n  \n  \n  \n    Section 3 (Mandatory non-technical skills)\n  \n  \n    Good communication skills, Team Player.\n  \n  \n    Problem Solving attitude\n  \n  \n  \n    Section 4 (Education Qualification and Certifications required, If any)\n  \n  \n    Bachelors/Masters\n  \n \n \n \n   If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!\n \n \n \n  \n    Not the right fit? Let us know you're interested in a future opportunity by clicking Introduce Yourself in the top-right corner of the page or create an account to set up email alerts as new job postings become available that meet your interest!"
    },
    {
        "company": "Vertiv Group Corp",
        "description": "Job Description \n Product- Senior Engineer/Assistant Manager, carry out various Product Development Activities. It includes working closely with Sales and Engineering Team. Understanding market requirement on Technical and Commercial aspects for any solution. Forming specifications, and getting it developed from Engineering team. Working further with Marketing and Sales team to launch developed product and manage entire Product Life Cycle. \n Additional responsibilities - System Integration & support activities that includes Product Innovation & Optimization, Verification of items, Testing of Products, Manuals/Documentation work, Managing Product configuration tool, Understanding tools of Microsoft and work with Cross functional Team. Along with other duties to be performed as assigned. \n \n \n  \n   DUTIES & RESPONISIBILITIES \n  \n \n 1. Handling different vendors for New Product Development and Value Engineering. \n 2. Work with team of engineers to create prototypes, test products and ensure that the final product meets all requirements. \n 3. Work closely with the sales team to provide technical expertise and support during new product launches, ensuring alignment with customer needs. \n 4. Interact with sales team and business partners. Identify upcoming market trends, competition offerings and generate solutioning around it. \n 5. Gather and analyse feedback from partners, service providers, and customers, and implement necessary improvements to our solutions. \n 6. Verify Bill of Materials (BOM) for smooth processing and accurate product configuration. \n 7. Demonstrate proficiency in Microsoft tools to effectively communicate and document product specifications and technical information. \n 8. Engage in cross-functional collaboration, working closely with teams such as product management, quality assurance, and manufacturing. \n 9. Managing C1 (Configure 1) software to configure and optimize products to raise Sales Quote. \n \n \n  \n   REQUIRED EDUCATION / EXPERIENCE \n  \n \n \n \n  B.E. / B. Tech in Electronic/Electrical/Instrumentation Engineering from recognized institute. \n  Minimum 3-4 years of relevant work experience in product innovation, optimization, or a related field. Equivalent combinations of experience and training that provide the required knowledge, skills, and abilities will also be considered. \n  Hands on Experience on Building Management System , SCADA, PLC Monitoring system, Data Center Project, with hands on Experience in Data Integration to HMIs on Single Dashboard \n  Hands on Experience on Industry standard communication Protocols like – Modbus, SNMP, TCPIP, Backent, Profinet over various physical medium like RS485, Ethernet and wireless \n  Good understanding of Products like Power Supplies, Precision Cooling solutions, Power Distribution Units, Security systems and Integrated Smart solution \n  Good to have – \n   \n    Product Development Experience on Microcontroller /Processor based Embedded system. \n    System Architecture knowledge \n    Electrical system and Single Line Wiring Diagram \n    Signal Flow Diagram \n    Flow Chart Diagram \n   \n  Able to work on achieving the target. \n  Ability to work in Large Team with diverse background and Global Team members. \n  Good analytical and problem-solving skills"
    },
    {
        "company": "LinkCxO Global",
        "description": "Company Name\n    \n   \n     Confidential\n   \n  \n  \n    Location\n    \n   \n     Mumbai, Maharashtra\n   \n  \n  \n    Job Type\n    \n   \n     Full Time\n   \n  \n \n \n  \n    Experience\n    \n    \n    \n     \n      \n       Min-\n      \n      \n        20 years\n      \n       \n      \n      \n       Max-\n      \n      \n        24 years\n      \n     \n    \n   \n  \n  \n    Posted on\n    \n   \n     Apr 30, 2024\n   \n  \n  \n    Function\n    \n   \n     General Management and Operations\n   \n  \n \n \n  \n    Industry\n    \n   \n     Professional Services\n   \n  \n \n \n  \n    Education\n    \n   \n     Experience managing a team of 20 or more engineers (preferable in data). 10+ years of relevant data experience. At least 20 years of work experience. Education in Computer Science or related fields. Well versed in Big data technologies and keeps knowledge current. Hands-on experience in Agile software development. Experience in data warehousing, data ingestion, data lake, machine learning and analytics pipelines. Skilled in SQL and Python. Cloud experience is required, preferably on GCP. Familiarity with the following technologies is a plus: Kafka, BigQuery, BigTable, DataProc, GCS, Spark, DataFlow, composer orchestration. Experience migrating on-premises databases and pipelines to the cloud.\n   \n  \n \n \n  \n    Skills\n    \n   \n     Must be able to work in a collaborative fashion with scrum team leads based in the US. Excellent communication skills, experience working with US based teams is a must. Experienced people leader. Illustrated history of living the values necessary: Customer, Innovation, Team, Accountability and Trust. The Right Results, the Right Way is not just a motto at our company; it’s a way of life. Unquestionable integrity and ethics is essential.\n     \n   \n  \n \n  \n \n  \n   Job Description:\n   \n     All data engineering projects for developing company's next-generation data platform will be overseen by the Director of the Enterprise Data Team. Our vital systems manage a vast network of infrastructure serving billions of users worldwide. The company’s data team is enthusiastic about working in a collaborative, forward-thinking, petabyte environment around the clock, and with a feeling of urgency to assist both internal and external audiences with solutions linked to infrastructure performance concerns. This Position Will Allow You To Over 35 Data Engineers are under your direction, coaching, mentoring, and staff management while working in an agile environment across many geographies. Lead strategic data projects and bear accountability for achieving team objectives and commitments. Put your attention on completing and carrying out multi-quarter projects. Take the lead in design sessions, participate, and translate into doable tasks that the team may allocate. Work together with colleagues to develop the various components of the data platform and make sure the engineers grasp the overall concept. champion for the data team, in charge of work happiness and staff engagement. Provide personalized and recommendation systems focused on the consumer experience. Recruit and develop technological expertise. Assign each team member specific objectives and goals, and give frequent, insightful feedback. Develop the junior team members by serving as a mentor."
    },
    {
        "company": "HCL Technologies",
        "description": "Technical Specialist \n  \n  \n   \n    Mumbai \n   \n  \n  \n   \n    2.5-5 Years \n   \n  \n  \n   \n    INDIA \n   \n  \n  \n   Job Description (Posting). \n   \n    Roles & Responsibilities:\n     \n     Monitoring and troubleshooting of LAN / W- Good knowledge on DHCP / DNS and other networking protocols.\n     Monitor, troubleshoot, and escalate production problems affecting network infrastructure\n     Hands on experience on network monitoring tools like ITSM Remedy is desirable\n     Co-ordinating with Carriers and working on troubleshooting on WAN links. Escalating issues at carrier end and driving issues till resolution\n     Troubleshoot and resolve telco issues resolution to be driven by engineer\n     Troubleshoot, and escalate production problems affecting network infrastructure\n     Troubleshooting IPSEC,NAT,PAT,GRE\n     \n     Required Skills\n     \n     Good Communication skill required\n     Advanced understanding in configuring and troubleshooting Routing protocols like RIP, EIGRP, OSPF, ISIS and BGP\n     Knowledge of QOS and multicasting required\n     Should have experience in troubleshooting complex network issues\n     Experience in troubleshooting LAN technologies like VTP , STP\n     Understanding of Gateway redundancy protocols like HSRP, VRRP, GLBP\n     Complete Understating of Small scale routers and switches such as 2800 , 2900, 3750 , 3900, ASR, ISR\n     Should have understanding of GRE, IPsec, site to site VPN, DMVPN\n     Understanding of VSS.\n     Understanding and troubleshooting LAN wireless issues, WLC, IOS upgrade on routers and switches\n     Understanding and troubleshooting MPLS, Frame Relay\n     Hands on experience on network monitoring tools like ITSM Remedy etc \n     Hands on experience in Circuit testing required\n     Should have Hardware knowledge on devices like 7600,6500,Nexus Series, 3750 etc...\n     Ready to work in 24 7 environment.\n     \n     Education & Experience:\n     \n     Btech/Mtech qualified (favourable - IT, Computer Science, Electrical Engineering).\n     CCNA Routing & Switching (mandatory)\n     4 9 years of experience in a technical network engineering role\n     (1.) To ensure that callsor chats are addressed within agreed SLAs (2.) To resolve escalations in a timely manner adhering to the process and quality compliance (3.) To maintain attendance, leave reports , breaks and shift rosters (4.) To update knowledge base through accurate documentation and disseminating knowledge from analyses and reports prepared to team for facilitating effective performance of responsibilities (5.) To perform adhoc analyses, SIP activities and infrastructure management (6.) To ensure postive customer satisfaction and feedback\n    \n  \n  \n   Qualification \n   \n    B-Tech \n   \n  \n  \n   No. of Positions \n   \n    1\n    \n  \n  \n   Skill (Primary) \n   \n    Data Center-Network Data-Network Data \n   \n  \n  \n   Auto req ID \n   \n    1386680BR"
    }
]